---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ForbiddenGroupConstraint
source: html/c0c91f4e-5e09-f7ed-c4ad-f557f843e651.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.ForbiddenGroupConstraint Property

You may not create sketch or family constraints between group members and elements which are not members of the same group.

## Syntax (C#)
```csharp
public static FailureDefinitionId ForbiddenGroupConstraint { get; }
```